{
  "id": "Acathexis - Immerse",
  "artist_name": "Acathexis",
  "album_name": "Immerse",
  "description": "Sometimes in a band's history, there's a moment where the calm comes after the storm – when their first output burns brightly, making itself almost impossible to compete with. To simply repeat it would be a mistake, so it's time to change. A significant change, but not in the core of the music, just a change in tonalities, from harsh to smooth, from pained to beautiful…\n\n\n\nThis is not the case with Acathexis.\n\n\n\nJake, Dany \u0026 Déhà return with their searing style of atmospheric black metal. Like the ebb and flow of the human experience, light-speed blast beats interweave with introspective passages to express a flurry of emotions and energy, with heartrending screams, harsh guitars that veil solemnity, produced triumphantly but with the mark of each member imprinted clearly upon it. They haven’t changed, and they have much more to say with the sound which has become their signature.\n\n\n\nProduced between their three studios in Argentina, USA \u0026 Belgium, the intercontinental band managed another tour de force with distance and discipline that, 6 years later, makes Acathexis a band that is more than just the coalition of members behind Mare Cognitum, Los Males del Mundo or Silver Knife, but a beast of its own.",
  "image_url": "https://f4.bcbits.com/img/a2276780432_10.jpg",
  "bandcamp_url": "https://acathexis.bandcamp.com/album/immerse",
  "ampwall_url": "",
  "tracks": [
    {
      "name": "Dreams of Scorched Mirrors",
      "total_length": 699,
      "formatted_length": "11m 39s",
      "lyrics": "In the hand is a trembling pulse\nthat weaved a tempest in the tides of blood\nand through the piercing rhythm of the heart, yet tired of beating \nmy inner storm was unleashed \nremaining invisible to others \nas a silent wind that precedes death.\n\nWhat do the others know? Those who assume calm for silence?  \nWhat do they know? those who have never dared to look behind the mirror? \n\nThose who never turn to look upon themselves \nthose who never found what is not sought \nthose who have never delved among the wreckage \nof what was thought to be known...\n\nWhen the crime belongs to everyone\nno culprit can be blamed\n\nThe deceitful mirror feigning to be full   \nEternally condemned to show things that never were\nIt shows me standing in the shadows of an empty room  \nAs the enigmatic waste \nIn which the red pupils, once in flames, \nnowadays find shelter drowned in a useless cry\n\nIn the presence of an irrecoverable absence \nThat writes on the wounds of a body\nsuturing with the needle and thread of words\nthe pain that inflicts the cruelty of the other\nWho trembles before the existence of the emptiness\n\nwhen death gets bored of playing with me\nall the mirrors will melt\nAnd I will take my steps into the void\nBut will I get rid of you?\nOr falling into darkness will we become one\nweaving in a macabre dance the thread of an invisible cloth? \n\nLike a farewell letter my eyes look one last time\nto the world consumed in flames\nin a fire that cannot touch me\nI am indifferent to it,\nI have become used to burning\n\nNow the dagger slowly makes its way through the flesh\nsetting loose the imprisoned blood \n\nWhen the crime belongs to everyone\nno culprit can be blamed"
    },
    {
      "name": "Adrift in Endless Tides",
      "total_length": 757,
      "formatted_length": "12m 37s",
      "lyrics": "And the dark night swallowed me \nin its eternal memory \nof the things that were  \nand those that will be.\n\nHow can we know how long we have been swimming \nin a dream that has been regurgitating us since the beginning of time?\n\nHow long have we been part of this eternal gloomy night?\nHow long have we been shipwrecked in a life\nthat the swaying of the waves turned into a nightmare?\n\nThis endless ocean which\nwe can't get out of.\n     \nThe useless attempt to reach the shore \nwithout knowing \nwe are destined \nto lose ourselves in the darkness. \nIt drags us to the depths \nto once again dissolve us into an impersonal shadow \nfeeding on our hopes. \nAn eternal monster devouring our souls  \nand we are nothing but prey wondering about reasons and causes.\n  \nLooking up at the sky I wonder \nif I can understand it.\nPerhaps the answer is whispered in the wind \nlike an almost infinite word being said\nbut it is so long and our life only hears a fragment, thus, unfinished, \nwe will never be able to understand"
    },
    {
      "name": "The Other",
      "total_length": 577,
      "formatted_length": "9m 37s",
      "lyrics": "I saw him slowly fading out\nFor years he visited me in dreams\nDreams that my memory struggled to erase.\nRetired into the peace that oblivion confers\nlooking to evade its memory,\nthat follows me like a dark litany\n\nEven with the hastened step of the years,\neach day has lasted an eternity\ndeceiving us in its succession.\nWe are nothing but prisoners,\nof an infinite trap that we strive to name\n\nIt doesn't matter anymore\nSoon we will be gone \nThere is no rush.\n\nClosing my eyes, I wake up\nand passing through that fog that clouds reason\nI find myself in the other, of whom I only know\nthe small pieces that I recognize in myself\n\nIn that escaping dance\nlike an endless cycle \nWho escapes and who pursues?\nCondemned to never find one another\n\nMaybe it's the eternal night\nthat connects us in its emptiness\nfinding in us\nits expression of pain\n\nBut the light refuses the stares\nand the awakening fades into regrets\n\nDo you really think your suffering matters to the universe?\nLook at the sky and tell me if a star has ever wept for you\n\nIt doesn't matter anymore \nSoon we will be gone \nThere is no rush.\n\nHow is one to know if those dreams \nwere nothing but the awakening \nof the other who dreams of me?\n\nWho knows if I'm not the other\nwho begs for death\n\n… And I will become one with all, and I will become no one\nMaybe I have been the other\nperhaps, I am no more."
    },
    {
      "name": "A Slow, Weary Wind",
      "total_length": 957,
      "formatted_length": "15m 57s",
      "lyrics": "The light curtain fell over me\nand no one will hear the muffled screams\nThat sound will remain inside of me\nlike an echo that tears me apart\n\nThe last page has been written a long time ago\nUnaware of it \nmy time has ceased forever\nI have already taken my last steps on this ground\nThat no one will remember \n\nPain let me go, let go of my hand, let me go once and for all\n\nAshes of memories, memories of ashes\nall in vain, wiped away\neternally erased\n\nHow much longer will this take, shattering me into pieces\nthe one who wants to leave\nand the one who lies here dying\n\nI will enter that ancient world\nforbidden to the living   \nWhile my body keeps fighting\nfutilely trying to hold me back\n\nPain let me go, let go of my hand, let me go once and for all\nLet me become that slow weary wind\nthat carves the stone\n\nties to life torn to shreds\nfading as the shadows on a sunset\nabsorbed by the eternal cloud of darkness\n\nthe extinguished torches do not light the way\n\nPain let me go, let go of my hand, let me go once and for all\nswallowing me into oblivion forever\nLet me become that slow weary wind\nthat carves the stone"
    }
  ],
  "total_length": 2990,
  "formatted_length": "49m 50s"
}