{
  "id": "Agriculture - Agriculture",
  "artist_name": "Agriculture",
  "album_name": "Agriculture",
  "description": "For something to be “ecstatic,” the feelings and emotions it evokes must transcend what we tend to experience most regularly in our lives. Ecstatic joy isn’t just happiness; it’s a feeling of jubilation which impacts us emotionally and in a metaphysical, arguably spiritual sense too. Although it has long been associated with connotations of the dark and macabre, extreme music has the ability to be a powerful mode of expression for these feelings of absolute bliss, overwhelming love, and awe-inspiring sublimity. Extreme emotions no less and those which black metal quartet Agriculture evokes with its ecstatic subversion of the subgenre’s tropes. \n\n\n\nWhat was initially a meeting and subsequent series of jam sessions between Kern Haug and Daniel Meyer, two musicians in the Los Angeles underground noise scene, would eventually manifest as a shared vision to portray the sublimity of the human experience through the vehicle of heavy music. Following the additions of veteran guitarist Richard Chowenhill and bassist/vocalist Leah Levinson to the band’s lineup, this idea would crystalize into the “ecstatic black metal” backbone of Agriculture’s music, first heard on the band’s 2022 debut EP, The Circle Chant. \n\n\n\nWith Agriculture’s self-titled record and first full-length LP, it’s abundantly clear that the band’s use of heavy music to showcase the most resplendent emotions and moments of the human experience has a far deeper meaning. Woven between the flurries of soaring tremolo picking, crescendoing guitar harmonies, celebratory screamed vocals, thoughtful improvisation, and meditative atmospheric passages is the record’s mission statement to experience the wonders and joys of both the esoteric and physical world. From examinations of self-acceptance, identity, and finding strength in others on “Look Pt.2” to depictions of deep communion with nature, the self, and the people we surround ourselves with in “The Glory of the Ocean” and “The Well”, the concepts and thematic questions previously planted by the band have blossomed into powerful, fully-realized artistic and philosophical statements. To put it in the band’s words, “...Where The Circle Chant is like a finger pointing at the moon, the self-titled LP is like a whole body screaming at it with reverence.” Through the extreme splendor of ecstatic black metal and the improvisational, experimental, and cathartic elements it embodies, Agriculture illustrates these otherwise incomprehensible questions with a poignant beauty that makes its music as much of an artistic statement as it is a transcendental experience.",
  "image_url": "https://f4.bcbits.com/img/a0553098895_10.jpg",
  "bandcamp_url": "https://agriculturemusic.bandcamp.com/album/agriculture",
  "tracks": [
    {
      "name": "The Glory of the Ocean",
      "duration": "8m8s",
      "lyrics": "Glory!\n\nI saw the ocean from up on a hill\nAnd I looked out upon\nThe waves\n\nI looked out upon the waves\nBecome individual things out of the mass\nEternal\nBreaking all over themselves\n\nI looked at the waves\nAnd felt surrounded\n\nI felt the water deep in my lungs\nI felt the water deep in my lungs\nAnd I let myself slip away\n\nGlory!\nTaking it in…\nMy body – give it away.\n\nAn empty space\nWith nothing after all\n\nYes!\nThis it!\nThis is the Ocean!\nMy body – give it away.\n\nNothing to begin with\nAnd nothing after all\n\n(Rise and Fall and rise and fall rise and fall ∞ )\n\nTime held me green and dying\nIn the mercy of it’s means\nThough I sang in my chains like the sea\nTime held me green and dying\nThough I sang in my chains like the sea"
    },
    {
      "name": "The Well",
      "duration": "1m54s",
      "lyrics": "A mother\nReaching out with a tiny mouth\n\n“I can’t just watch the boy die\nAll alone, and both of us crying”\n\nThe sand gets wet\nTwo little salty piles\nMother and child alone\n\nThen God\nReaching out with mighty hands\n\n“The well was always there\nFill the skin and give the boy a drink\nLet the sand get wet”\n\nThere is always plenty of water\nThe mother and the child"
    },
    {
      "name": "Look, Pt. 1",
      "duration": "2m9s",
      "lyrics": "A mother\nReaching out with a tiny mouth\n\n“I can’t just watch the boy die”\n\nAll alone, and both of us crying\nThe sand gets wet\n\nTwo little salty piles\nMother and child alone\n\nBright eyes\nOpened up by mighty hands\n\nThe well was always there\n\n“Fill the skin and give the boy a drink”\n\nLet the sand get wet\n\nThere is always plenty of water\nMother and child alone"
    },
    {
      "name": "Look, Pt. 2",
      "duration": "5m47s",
      "lyrics": "In Dallas plain—\nA wide vector of thing\nYou call a big empty—\nWarm, hovering in situ.\n\nAnd in this sand,\nAn endless pain\nOf judgment and self-\nReckoning,\nThe same stiff air\nAll my life\nDown.\n\nAnd through it all,\nYou call my name,\nWelcoming.\n\nAnd, seeing me,\nYou, divinity, call\n\nA car engining,\nDead Road,\nSlendering—\nAll alone, ride.\n\nYou pull my arm.\nYou, calling me.\nYou suffer fate\nAnd self—\n\nAnd through it all,\nYou call my name,\nWelcoming.\n\nYou turn around.\nYou’re hollowing.\nYou couldn’t find me in the dark."
    },
    {
      "name": "Look, Pt. 3",
      "duration": "6m23s",
      "lyrics": "Reach in your chest and pull out your heart\nReach in your chest and pull out your heart\n\nReach in your chest and pull out your heart\nReach in your chest and pull out your heart\n\nRighteous Man\nDreaming on an airplane\nOf light conversation\nLight conversation\n\nRighteous Man\nDreaming on an airplane\nHigh above it all\nLight conversation and laughter"
    },
    {
      "name": "Relier",
      "duration": "6m51s",
      "lyrics": "Relier, Relier, Relier.\nOutside my window is a tree\nI look forward to seeing it in the morning when I rise.\n\nRelier, Relier, Relier\nThis is the holy dark: outside choices that you can’t make\nhow it’s beautiful to accept you are part of everything\nWith no control.\nTrust! Trust! Trust!\nI call it God…\n\nGod in ______"
    }
  ],
  "total_album_length": "31m12s"
}