{
  "id": "Ethereal Shroud - Trisagion",
  "artist_name": "Ethereal Shroud",
  "album_name": "Trisagion",
  "description": "Track List:\n\n1. Chasmal Fires (27:47)\n\n2. Discarnate (13:54)\n\n3. Astral Mariner (22:34)\n\n4. Lanterns (bonus track) (13:37)\n\n\n\nplease note: If you downloaded this before January 2022, please redownload it so that you can have a digital copy of 'Lanterns'. It is now included as standard in the digital edition.\n\n\n\nTo be released December 10th on CD and cassette on Northern Silence records and Throne Records on LP at a later date due to pressing plant backlogs.\n\n\n\nWe are watching the disintegration of our past-held moral structures in real time. The paradigms of what we held as unshakeable, unquestionable truth be brought to the ground. Be this through decades of struggle or in the blink of an eye, we've watched people fight for recognition for what others in positions of power - often unearned - take for granted. Several cycles of history have gone through this same phenomenon time and time again, and yet as a species we are blind to it due to our own untenable nature of greed.\n\n\n\n'Trisagion' is a term meaning 'Thrice Holy' and used to denote an orthodox hymn in three parts. Each of the songs on 'Trisagion' are split into three movements. Over the last six years I've composed these three songs that each deal with the increased cynicism and disdain of how I have come to view the world. The way we cling to long-outdated paradigms to guide us rather than what we see in front of us and the refusal to take one another at face value, the rise of fascism as a means to bolster one's sense of self and divide and the habitual method of destroying the planet we live on for short term gain at the expense of those that will come after us. The esoteric emotions that I feel towards others and the way I relate them to my own way of coping. The impressionistic artwork of Trisagion, expertly done by Phil Lang, shows the terrifying way one can see these paradigms - as terrifying structures to be feared, obscure yet stark contours; yet old, disintegrating, and with a generation desperately clinging to their foundations hoping not to crumble under their weight.\n\n\n\n'Trisagion' is a black metal album equally as challenging as its subject matter - uncompromising track lengths that don't waste a moment, eschewing repetition in favour of purposeful construction. Despite its raw intensity, it relies on huge symphonic undercurrents to carry its message as well as an array of textural exploration that Ethereal Shroud has yet to foray into. Six years is a long time to follow up a record, argued by some to be a standalone masterpiece. It no longer stands alone.\n\n\n\nCreating this record was no small feat - financially, emotionally and physically it was a draining experience. However, I could not be prouder of the result and I'm ready to reveal it to the world. Thank you for paying attention.\n\n\n\nEach song on the record comes with its own impressionistic illustration to match it. The PDF with the lyrics and these illustrations is available with all digital downloads, as well as being printed in every physical format.",
  "image_url": "https://f4.bcbits.com/img/a4090213334_10.jpg",
  "bandcamp_url": "https://etherealshroud.bandcamp.com/album/trisagion",
  "tracks": [
    {
      "name": "Chasmal Fires",
      "duration": "27m47s",
      "lyrics": "How wise the God who trades his son for lesser men \nWho seek no temple, only avarice and permanence\nJudge not the heart, but thy devotion\nKeep those who remain\nAs close to salvation as to destitution\n\nI can't explain what it means to be whole\nYou took that virtue away from me\nA kingdom adorned with the thorns of thy idol\nWho scorn the breath of truth and reason\n\nWe cannot pretend\nThat the rules are the same\nFor the blasphemer and the saint, the blasphemer and the saint\nWe cannot pretend\nThat the rules are the same\nFor the commoner and the priest, the commoner and the priest\nThe toils I've endured are so far beyond meaning\nThere is no greater voice, only tenets and blood-stained stones\n\nYour archaism dies this day\nYou are but the shadow of a lie \nFeeble and brittle like silence\nBending the fear of earnest held faith\nYou took the world from us\nFrom cracked and sullen hands\nAs hope slipped through our fingers\nAnd sank beneath the sands \n\nFire sows the fire\nWrath rends retribution\nEffigies casting shadows\nLikening tyrants to deities\nBefelling monuments\nTo prove hence from this day\nWhat's written in stone\nCan crumble to dust\n\nTo what end was I made this way\nIf my nature is a transgression\n\nI cannot build myself up again\nTo watch myself fall apart at the seams\nI cannot walk if I'm destined to fall\nThrough trials by design of cruelty and hate\n\nYou are so frail\nYou hide behind your fear\nYour faith is a mask for your insecurity\nAnd you wield it like a sword\n\nSummoning the flood, the call of the raging seas\nApollyon's wake before the world \nWe ache, we fear and we suffer for naught\nUndue and unjust is the the folly of Christ\nTransient echoes from a long lost era\nCannot conceive my fate \n\nI suffer the want for a better world \nAnd the need for compassion in terrible times\nGreat is my weakness to punish myself for\nA love forbidden by those who bore me\nBehind the weight of this cage of bones\nIs a heart that sinks at the sights of greed\nOf a Lord who damns his beloved creation\nFor sins he determined his sons to commit\n\nI cannot pretend\nThat I am the same\nAs I once was\nAs I once was\n\nIf dreams lie in tatters\nAnd a soul knows no purpose\nWhat can I hope for\nWhat can I live for\n\nThere was a time where\nI could forgive\nBut I've lost so much\nSo fucking much\n\nI hate that I hate\nAs it brings me closer to you\nI am not what I am\nI am not what I am\n\nI am so lost in this place\nThese vast surroundings compel me to dread\nAs I sink within myself\nForging an irrepassable path\nI can't regret what I feel is just\nI am one with the sword you held to me\nReflection in the steel\n\nI am not what I am\nForged and contorted\nI am what I am\nForged and contorted"
    },
    {
      "name": "Discarnate",
      "duration": "13m54s",
      "lyrics": "I lost myself in fear of the unknown\nAn enigmatic constant of a cold malignant form\nTo rise within me as a rush of boiling blood\nI seethe at the sight of your face\nBut it might as well be a mirror\n\nUnyielding...\nI cannot contend with the instinct to hate my fellow man for his nature\nWho are we to justify these means if the end is counting the dead? \n\nWithin ourselves is the choice to love or hate\nTo use one's faith as an impetus for scorn or a guiding hand\nTo cast light with it or cast a solemn curse\nI chose to suffer\nWithout form, without remorse\nWe are alone\n\nI am not afraid to fall \nI am not my fears\nHumanity's weakness is a curse to carry with grace\nBut it will not be my ruin\n\nWithin ourselves is the choice to love or hate\nTo use one's faith as an impetus for scorn or a guiding hand\nTo cast light with it or cast a solemn curse\nI chose to rise\n\nWe are one\nYou are nothing\n\nAbsolve yourself of your pain\nYou are stronger than your oppressor\nTheir insecurity\nWill be your triumph\nAs the fire burns\nCreating smoldering ruins\nBring righteous light\nBring righteous hope\n\nWithin ourselves is the choice to love or hate\nTo use one's faith as an impetus for scorn or a guiding hand\nTo cast light with it or cast a solemn curse\nI chose to stand\n\nOnly the weak would let fear rule their hand\nOnly the frail would hate their fellow man\n\nWithout form, without sight, without light \nYou govern mind and man\nIn your discarnate form, your influence has guided hands\nTo wield swords with wrath\nIf I alone can see your futility\nThen you see it yourself\nI am stronger than I was years before\nFrom when I knelt before you"
    },
    {
      "name": "Astral Mariner",
      "duration": "22m34s",
      "lyrics": "Movement...\nI'm asleep in a fog\nThat nothing can cut through\nThe constant of time standing ever still\nWaters pristine, oar rippling stars\nAn endless expanse\nEmpyreal mirror\nWhat is this light\nPiercing heaven's sky\nI cannot see\nI cannot see\n\nIf only I knew\nWhat this weatherworn face would see\nI'd have set sail for another shore\nThese seas tumultuous and merciless\nThose sent to guide me only drove me deeper into storms\nBeset into defeat, gripped by paralysis\nPumelled by relentless rains of doubt and despair\nDespite the weight of it all\nI'm not sure if I felt it at all \n\nAnd as I sank like a stone\nI feared too much to ask of you\nTo reach down and pull me in\nOr to turn away and let me go\n\nLeave me here\nI'm the only one I trust\nNot to deepen these wounds\nCast me adrift\nI'm safer alone\nI can guide myself home\nWherever that may be\n\nWhy am I so numb\nTo the terrors I've seen\nTo the pains I've felt\nTo the fear I've known?\nCountless in number they are\nThey say they are my strength\nBut each scar is a weight\nPulling me further\nEach make me sink\n\nForlorn visions of bygone times are lost in the swell\nReality's rawness is lost to the daze\nBring me sleep\n\nYou are lost but I have found my own place\nIn this maladjusted world we call our home\nI hid in the stars\nI conjured a world\nI made my escape\nYou cannot hurt me here\nI longed for the same as you\nBut I'm at peace now\nWhatever story they tell of me\nThrough the lens of misjudgment\nMeans nothing to me here\nWith doors open wide\nCome find me"
    }
  ],
  "total_album_length": "1h4m15s"
}