{
  "id": "Infant Island - Obsidian Wreath",
  "artist_name": "Infant Island",
  "album_name": "Obsidian Wreath",
  "description": "Fury in mourning. This is the emotional world in which Infant Island’s third album, Obsidian Wreath, wraps itself and its listener. It is an album about trudging through the end of the world: where climate catastrophe, the acceleration of capitalist extractive exploitation, the apathy towards social health which has emerged from recent mass death, and an endless stream of other ongoing crises too numerable to be named, constantly haunt the edges of our vision, like a rot that sets in on the borders of being. Obsidian Wreath is an album about the hopelessness of the slow violent decay of the world, about reckoning with a totalizing, impossible condition of reality which never stops confronting you with the question: how do we continue?\n\n\n\nThis is the question which Infant Island contends with throughout this record, a question they meet with fervor, with ferocity, with a determination and clarity marked – sustained, even – by grief. Lyrically, musically, the album shifts between light and darkness, using such tropes and their accompanying affects not in their cliché forms as opposing forces, but as mutually determined states of being which implicate and deterritorialize the Other. There must be something beautiful that can emerge from something terrible – this kind of impossible hope, an optimism that only emerges only from the condition of absolute pessimism, guides the album’s thematic considerations. Perhaps this impossible faith has something to do with how Obsidian Wreath has come into existence – being written in 2020 but releasing in 2024, the record’s slow birth reflects a force of will which was required to survive a global event which threatened the music industry and the people in it at every level.\n\n\n\nThis contradictory pessimistic optimism is realized as well in Infant Island’s singular songwriting, which filters Virginia screamo through the melancholic furor of American Black Metal acts like Panopticon and Deafheaven. Obsidian Wreath continues and advances the band’s masterful weaving of heavy genres, combining screamo and black metal with a deft movement between the sweeping emotionality of shoegazing post-metal, the hard-hitting grooviness of new-school grindcore, and the searing feedback of noise rock. Each composition flows seamlessly into the next, making this fluidity of sound feel not like an oscillation between styles, but instead like the tracing of the contours of a scene, as though Infant Island are tracing their own artistic singularity through the historicity and creative multiplicity of American extreme metal. One cannot shake the feeling that this is music born from a desire for community – where we are accompanied through this world not only by our friends and family but by the ghosts, the historical presences we feel but remain forever out of sight, that we unwittingly follow every day. Produced again by Virginia legend Matthew Michel (Majority Rule, Nø Man); with guest spots from Harper Boyhtari and Logan Gaval (Greet Death) on “Kindling,” Andrew Schwartz (.gif from god) on “Another Cycle”; and with contributions from members of Undeath, King Yosef, For Your Health, Senza, Malevich, Mikau, and more – one can’t help but feel that sense of community. Infant Island invites you into a scene, welcoming despite all its aesthetic harshness.\n\n\n\nIn this way, Obsidian Wreath is the kind of heavy music that would feel most proper to hear shuddering through the red clay bricks of rural Virginia, its place of birth. It is music that carries in its melodic intensity the materiality and contradictions of its Southern home, so geographically near, yet so culturally and economically far from the centers of American hegemonic power. The album art, from Virginian folk artist Sarah Bachman, captures this social rootedness, contrasting the ethereality of an Appalachian night with the chaotic obliterating power of a wildfire. Silhouetted figures, between ash and shadow, are imprinted on the ground, absently present, ghosts which cling to the land and to each other. Bachman’s art expertly captures the political and emotional stakes of Infant Island’s songwriting: a refusal to let go of this world.\n\n\n\nObsidian Wreath is the culmination of Infant Island’s entire discography, synthesized into one LP and turned up to 11. As begun with 2020’s Beneath and Sepulcher, four years later it continues the band’s artistic direction to darker, harsher moods and sounds while also putting them in contrast with their most delicate and experimental Infant Island arrangements to date. It is a relentless, furious, and ever-shifting composition which coheres around expert composition and a single-minded interrogation of how we can possibly continue living in the state of this planet. In “Veil” at the midpoint of the record, all members of Infant Island, as well as many guests, chant together in unison to insist that “this world is enough.” Standing in community, Infant Island insists not that the conditions of the world in which we live are adequate. No, they insist that this world contains within it already what is needed to transform it into something better and freer, something which will sustain the lives we cling to.",
  "image_url": "https://f4.bcbits.com/img/a2522473379_10.jpg",
  "bandcamp_url": "https://infantisland.bandcamp.com/album/obsidian-wreath",
  "ampwall_url": "",
  "tracks": [
    {
      "name": "Another Cycle",
      "total_length": 171,
      "formatted_length": "2m 51s",
      "lyrics": "[Daniel:]\nImprisoned several thousand years\nI have awaited you, oh obsidian seer.\nPalm of iniquity\na reliquary withstands\nmy sincere welcoming\nof a voiceless despair.\n\nVoidless, yet flourishing.\nVoidless, a life contrived.\nVoiceless, yet alive in the end.\nVoiceless.\nA part of another cycle.\nIt stills the air and swallows control.\nIt conquers the worst in us and ensnares\nour souls and so we exist without question.\nLiving amongst those\ncradled to necessary fate.\nI suppose this is the end.\nWithin our eyes,\nyour will a part of me,\nmy favor undying for you.\n\n[Shorts:]\nRot in dampened neath.\nGaze upon the gloam as it drips:\nfestering,\nforgotten."
    },
    {
      "name": "Fulfilled",
      "total_length": 96,
      "formatted_length": "1m 36s",
      "lyrics": "[Daniel:]\nAll to share a gaze upon a window  \nfor which there’s no luxury\nof safety, nor opportunity,\nnor hope, which you seldom sell me.\nTo relinquish our dreams under the guise\nof a lucky lottery –\nhow could you spare to inconvenience your comfort?\nCould I afford the fear someday?\nCould I retain the hope of a false sense?\nAre we to swallow a golden dream?\nThey peer down upon us with\nprivileged scrutiny.\n\nEaten alive\nReviving an ageless lie\nEaten alive\nAn eye for a mind\nEaten Alive\nReviving an ageless lie\nEaten alive\nAn eye for a mind\nA soul for your time\n\nTo forget that which we are bled.\nTo descend, how perfect, we the dead\ndeliver all our presence.\n\n[Daniel \u0026 Kyle:]\nI will collapse and never be –\nand your will so charitably\ngiven, a life portrayed, displayed\ninside a shell which you will never free."
    },
    {
      "name": "Found Hand",
      "total_length": 135,
      "formatted_length": "2m 15s",
      "lyrics": "[Alex:]\nBound at the wrists,\nstung by the rope,\nagency stripped,\nabsent of hope.\n\nThis empty world,\nthis empty life,\nthis hole of a body\nis empty inside.\n\nBroken and bowed\nunder the weight.\nGutted and owed:\nall futures erased.\n\nMy hands removed,\nbloodied and maimed.\n\n[All:]\nOur hands..."
    },
    {
      "name": "Clawing, Still",
      "total_length": 171,
      "formatted_length": "2m 51s",
      "lyrics": "[Daniel:]\nA part of every living thing that claws from its caged love dwells its incessancy.\nI will forever become the raging water.\nPummeling mesmer as you try\nand seep through suffering as if\nthere’s an escape: cognition or real reason.\nTruth be told\nall lividity beholds\nfinality, wreathed into momentary amethyst.\nI will not,\nI will not,\nI will not contend your hive of apathy,\nas your sky comes crumbling down upon ages.\nStumbling upon your own life untaken,\nrelease me from your broken dream:\nobsolete in everything.\nSurfacing exposure rages over you.\nSurfacing exposure, my rage over you\nwho refuses every tide to turn the hand.\nMy worth to grovel at a throne of grandeur.\nRelease me.\nLifeless value served under fate.\nI choose to fiddle truth, that some stoic\nmirror you feel resembles a life wanted.\nLacking a final cure\nfor you to change."
    },
    {
      "name": "Veil",
      "total_length": 292,
      "formatted_length": "4m 52s",
      "lyrics": "[Daniel:]\nWitness across the board\n'til it may unravel.\nAll thoughts of decaying oneself,  \nalways still awake.\nI hear them less, upon cresting waves\nsunken to bottomless depth.\nSo do you return? The fear swelling in your lungs, our most cherished memories are lost in dark cavernous futures.\nAnd I shall choose to retain my own light\nto decide, oh, to decide what little warmth of this shade I desire. And I choose to face this, stripping off our masks, and yet, faceless? Strange and inevitable.\nSome part of this is familiar,\nsome sort of natural disaster all too serene to see...\nDo you share any part of anything?\nDoes it help to stare into your void of misery? Rejecting what you cannot change.  \nEating away at your own dreams til you shed every part of you. Til you count your endless steps, all of which that you refuse still, always a face of disbelief, always continuous, always incomplete. And my eyes wander upon the skin that crawls with every pointless feeling of indefinite sorrow, drowning in my own fear, or welcoming it, I wish but I cannot save you, within these moments sheltering ourselves from misery.\n\n[All:]\nAll darkness, all blood; all cynics, for what?\nThis world is enough."
    },
    {
      "name": "Amaranthine",
      "total_length": 255,
      "formatted_length": "4m 15s",
      "lyrics": "[Daniel:]\nEternity weaved over your lavender grave,\nlike sunlight plagued upon a closed door.\nWashed over every fold, nook, and corner\nof this earth resides a part of you.\nMy dream was to live in a circle of this,\nnight or dawn, pain or bliss.\nI could bare none of it,\nand I could despair,\nbut I could bare none of it.\nYet the vine keeps growing,\nflowering with little light or water,\nit creeps into my bones:\namaranthine, composed of\ntorture, embedded to blossom alone.  \nYet alive like sunlight, nonetheless."
    },
    {
      "name": "With Shadow",
      "total_length": 230,
      "formatted_length": "3m 50s",
      "lyrics": "[Daniel:]\nTalk lively,\none who aches.\nWith shadow, impassible.\nAs your walls hold \u0026 hang,\nall fearful merits.\nAnd with you, they will\ncrumble, tall.\nScripted, one, by an altering contract.\nYour grasp held, with everything that tunnels up, and every day you sink in your\nhell.  \nI walk by all dead endings –\nwill reduce your stain\nof certainty and judgment,\nstrain my vision to filter,\nyours perishing.\nI feel and strew every corner of you, like shifting one foot all too soon, and all tunnels. My hollow dooms with a bleak hope.\nYour shadow devours you.\nSo, further, a creature shall crave to only become like marrow you feed upon.\nWithholding all of us from every crevice of salvation I ache towards it,\nto only dig into yours.\nDig deeper and deeper into my skin.\nWill you see?\nWill you dig deeper and deeper into our skin.\nOnly to find?"
    },
    {
      "name": "Unrelenting",
      "total_length": 158,
      "formatted_length": "2m 38s",
      "lyrics": "[Daniel:]\nYour flames rain bright vermilion\ndancing against this frigid obsidian.\nAnd I choose to challenge\nwhat little hope you have.\nAn echoing decay of a last stand,\nit comes, and molds itself over our bones.\nWith no shelter to sustain, it smothers you\nand then it stays there, harboring fear.\nTil the last drop, leering, just like a fly; cold,\ncollecting, controlling a tide of despair.\nLeering, just as it lies,\na burning ember dormant, it chooses to rage.\nUnrelenting,\nigniting everything, it consumes.\nYou feign\nand recoil your hate towards a pool of\nsuffering.\nOur burning embers pressed against our chests.\nOur burning embers\nraging against you."
    },
    {
      "name": "Kindling",
      "total_length": 242,
      "formatted_length": "4m 2s",
      "lyrics": "[Harper \u0026 Logan:]\nIt's a star-soaked ladder,\nTwo beating hearts.\nIt's a dagger rising in the dark.\n\nI've been watching ships go under.\nCold fingers drag the captain down.\nTransfixed by violent thunder.\nThe hand of God can't save them now.\n\nIt's a blood-stained letter.\nIt's a siren's song.\nIt's a love that shines before it's gone.\n\nI was walking the river facing\nthe water treatment derelict,\nlike a man on death's watch pacing,\nsearching for signs of passing ships.\n\n[Daniel:]\nFeeding through one lifespan to hold your suffering.\nSwoon only to succumb to fearing.\nI know not what lies ahead within the dark of night.\nSignals lying distant among an endless horizon.\nKindling our lonely fires, we nurture our frozen dreams."
    },
    {
      "name": "Vestygian",
      "total_length": 417,
      "formatted_length": "6m 57s",
      "lyrics": "[Daniel:]\nBreaking through,\ninto the screen\nfor nothing to conclude.\nIt lasts, and so?\nUnloving, I chose to oppose.\nThough you claim us, unchained and free?\nYet here I stand, everlasting and loving.  \nWhile here I suppose, wilted and given\nwhile these hands tremble,\nI’ll search and find, your miracle\n\n[Alex \u0026 Kyle:]\nBlinding light –\nis it the end? Or a tunnel?\nEndless blight –\nIs it endurance? Are we helpless?\n\n[Daniel:]\nYet – dare I choose to accept? It’s dust in my dreams, remarking how a moment’s breath drifts off without the wind. And so the darkness crept up, to rest beside our cursed heads. And so you spill your dreadfulness,  dwindling from within.\n\nHow do you choose to burn so bright?\nHow do you kindle a warmer future?\nA warm bright light enclosed\nShade of myself indisposed\nSo I shall fade or rage\nNurtured within your cage\nNo escaping\nAll along, I was you\nWatching\nI burn\nIn the dying of light\nI burn blinding\n\nAnd how do you live with such malice?\nSuffered and calloused\nIn the dying of light, I burn\nBlinding what you choose to see\nA different understanding\nSeared within a dream\nI was your rage\nWatchful from afar"
    }
  ],
  "total_length": 2167,
  "formatted_length": "36m 7s"
}