{
  "id": "Slugdge - Esoteric Malacology",
  "artist_name": "Slugdge",
  "album_name": "Esoteric Malacology",
  "description": "Delve into the the mephitic melodies of Molluscas malodorous minions once more with Esoteric Malacology, the latest gastropodean gospel from Slugdge. Journey through the annuls of Slishic history; through the death and rebirth of the supreme cosmic overlord, and unlock mental gateways to even more horrendous and nonsensical realities than ever before",
  "image_url": "https://f4.bcbits.com/img/a1718888280_10.jpg",
  "bandcamp_url": "https://slugdge.bandcamp.com/album/esoteric-malacology",
  "tracks": [
    {
      "name": "War Squids",
      "duration": "7m56s",
      "lyrics": "Reforged in the furnace of death\nweaves fates in the warp and the weft\ndimensional rifts quake in the skies\non worlds born and razed in a blink of your mortal eyes  \nMaster, born of the plasma\nsiphoning strength from the black twisting nether\na rapture that fractures the cosmos \ntorn from the womb of primordial chaos\n\nRhaexorog come forth\nhordes of iron must be wrought\nMolten shells of steel ablaze\nCast in slime and living flame \n\nBathe the abyss in cosmic afterbirth\nhe shall arise to reclaim the multiverse\nIn noxious sanctums beyond the walls that keep \nthe cursed sleepers from the beast\n\nfeel the blessed touch of the unmaker\ninto this verdant nightmare you slip farther\nstalked and hounded in this dream forever\nsport for the beasts of Ankath-Shol\n\nWallow hopeless under starless nights\n\nYearn for the return of the creator's flame\nGaze out from the horizon and behold the sundering\n\nDark blood coursing through our mortal veins\nwe are unstoppable\ninfused with arcane power; the boon of Lord Yeth'Shuul\n\nPandemonium; a war in heaven, cataclysmic copulation\ntransdimensional astral tentacles\nmost irreverent fornication\n\nThe wheel spins once again\ncyclical time, no beginning or end\nsubject to no known law of nature\nin wormholes entangled that hang in the ether\nScatter the remnants hereafter\nblacken the stars with the power of the atom\nwe will shatter the order of aeons\nunleashing his infinite legion of scions"
    },
    {
      "name": "Crop Killer",
      "duration": "7m19s",
      "lyrics": "Is this how you want to live your lives?\ninside the vultures circle\ncan you feel the talons in your neck?\nOnly the strong survive you say?\nJust pray that prey you don't become\nYou've got no time for safety nets\n\nThere are no alpha wolves\nOnly those struggling to survive the state of nature\nDomestic animals lost without the trappings of their civilization\nYou like to play armchair eugenicist, militant pessimist\nAn ivory tower that's built upon\nthe product of a million labors\n\nRegression to the mean, repression of the weak\nfraudulent pyramid scheme of human hierarchy\n\nDo you ever wonder why you've been deprived\nthe wealth of nations?\ndo you feel the trickle down your leg?\nPreoccupied with war against your own and your own home\nHow is it you're not already dead?\n\nAnother failed experiment \nEvidence suggests you will not pass the last great filter\nThe soldiers won't defend the hive\nwhen the Queen neglects to satisfy the builders\nYou like to play the devil's advocate, passive and impotent\nbrood over fallen empires\nThat were built upon the bones of millions\n\nNarrow minded sanctimonious\nself-serving sophistry\nGreed governing holiness?\nNot in the version I have seen.\n\nYou will not see the stars\ndoomed to the tides\naccess denied, fated to die"
    },
    {
      "name": "The Spectral Burrows",
      "duration": "5m49s",
      "lyrics": "Lost in a churning mindless fulmination \nDevoid of a reason or explanation \na chorus of voices become a roaring cacophony\nassaulting our senses as they sleep\n\nputrid beings within, no better, or worse\neach one scrambling for a ladder\ndeath becomes us, that which we adore\nlong lost innocence\n\nIn these slime-ridden Kingdoms where we wallow\nfree from the pity, disgust and sorrow  \nfar from where light can pierce\ndrowned by the fetid bog\nbeyond the graces of your god\n\nSink in, inhale the ichor\nwhy not assume your true form?\nJoin with us this is our blessing\nunified as one forever\nbiologically entwined\nTogether until the end time.\n\nhideous depravity lurks beneath the mask of civility\n\nLook to your heathen master for his coming\nWe shall obey him and speak of nothing \nMentor of pain and suffering\nthe spawn of the sentient ooze \nSoon you will drown within him too \n\nin the name of the Greatfather, worship him and no other\nBestow upon us the sigil, arise from your silent ritual"
    },
    {
      "name": "Slave Goo World",
      "duration": "6m25s",
      "lyrics": "Stygian minions of esteemed erudition\nbear witness to the most abject human condition\nstaunch technicians of decomposition\nbreathing life into the lifeless animating his vision\nall partake in occult calibration\nrealigning the ley-slime for the dark invocation \nsing on high to the lords long unspoken\nReborn into the world through the minds of his chosen\n\nPsychic virus from the vast outer reaches\nmarks the grand unification of science and religion\nIn the name of our brethren; the Molluscs\nlesser lifeforms prostrate before the horror of horrors\nterrible vistas of a nihilistic future\nthe old cthonic scriptures; the new jurisprudence\nto usher an era of grand cosmic culture\nall nations and worlds under the sign of Mollusca\n\nSubmit your soul, for it's no use to you where you go\nBeyond the passage of time\nEmbrace the void in which all things were made and destroyed\nwe shall be one in his mind\n\nPraise be the name of the dark incarnate\nGreat beast of the all-in-one\nFirst of the gods from the formless chaos\nKindling the flame of the suns \n\nHis children most resplendent and pure\nshall inherit the order of worlds\nFrom the lowest dominion unto the mucus throne\nthat this Kingdom might ever endure\n\ncast off the flesh become one with the ooze\nand through the god-mind what's broken is renewed"
    },
    {
      "name": "Transilvanian Fungus",
      "duration": "7m29s",
      "lyrics": "Airborne pathogens\na contorting carcinoma multiplies without end\ninvasive genophagia, irreversible damage\ndismantling and reassembling their nucleic acid\n\nshambling eldritch beast, a mindless vector of disease\nthe brain erodes, flesh calcifies, controlled by endoparasites\nYour mind and body are not your own, play host to hostile lifeforms\nUnseen, explosive haze, with every breath you become their slave\n  \nThis world was never yours to begin with\nand nor will it be in the end\n\nAs you devour, so shall you be\nthis plague never replete\nAgainst this foe there is no victory\nself-destruction written in the genes\n \nThe wilderness reclaims these empty streets\nhistory is forgotten\nonce thriving metropolises now mortuaries\nderelict, old and rotten\n\nTheir cradle is our grave, new life born of decay\n\nWe prosper from their ruin\nAs our progeny lament, we will not be forgiven\nThe storm on the horizon writes their names in the sky\nas we gamble the future on the roll of a dice"
    },
    {
      "name": "Putrid Fairytale",
      "duration": "6m55s",
      "lyrics": "Corrupt ignobility adorned in pilfered gold\nconceived in sewage by insipid lords of old\ninbred degenerates languish in squalid halls\nimpotent and superfluous, unable to uphold\n\nthe basic tenets of the creed\nusurpers vie to supersede\na tired waning hegemony, long bereft of majesty\n\nSelf-righteous justiciars desire to purify \na world of lies, that seeks to purge the earth and sky  \nlicentious seditionists; gorge as your planet burns\nfrom slime they came, and into slime they shall return\n\nPraise the primordial poison pools that gave us form\nto defy his decree, they dare to bite the hand that feeds\n\nThe custodians have become the abuser\nignorant beings with arrogant ideas\n\nThey loose a hail of arrows\nthat scorch the eyes of all who gaze\nbut it won't save them from the hell that waits\n\nMythologized transcendence, a paradise is lost\nNo deliverance from the dire cost\n\nThey've chosen the form of the destructor\nMore of slime than blood\ntheir planet torn asunder by plutonium\n\nMercury rising, the surface scorched\nThey descend like rats into the bowels of earth\n\nDigging like roaches through a mire\nof their own self indulgence\ncaught in a web of fate\ntoo bloodless to escape\n\nNo god can save you now\nfor they have no power here\nwithin these ashen crypts\nof suffering and despair\n\nthe flame ignited in it's heart\na chain reaction tearing apart\nreaching the critical mass\nThe weapon of their futile vengeance\n\nThe eye, ablaze with radiance\nthat sears against your flesh\nDread rumbling in the deep\nsignalling the impending death\n\nblinded by a caustic storm\nthe slamming of cyclopean doors\nheld aloft the orb ignites\nNowhere to run now from the light\n\nNow standing in the presence of a foe conceived by alien gods\nNever again to feel the sun, it immolates you\nThe Life-age of the universe, a wind that sweeps the world away\nyou feel the weight of every world bearing down on you"
    },
    {
      "name": "Salt Thrower",
      "duration": "8m54s",
      "lyrics": "Speak to darkness in your lowest ebb;\nonly silence\nthere's no future, only past regrets\nmeditate on them\n\nsuspended in infinite blackness\nso numb, agony is no distraction\ncontempt for life replacing sadness\n\nIs this clarity or madness?\ntemporary energy and matter\nthe will to live is irrevocably damaged\n\na listless spirit wants to leave the world\nsweet oblivion\nvital essence grinding to a halt\nwe are all at fault\n\nfalling from the creaking rafters\npressure, so much worse than you imagined\nburning, death's umbilica unravels\n\ndrifting from his sweet embrace\ngasping for breath, staring in the grave\nonly fear, as what little light left fades\n\nAnd on the pedestal, these words appear\n\"Look on my works ye mighty, and despair!\"\n\nNegated by the unbearable truth\nall-consuming psychotic fugue\nfall to a lightless self-destructive end\nfor there is a monster in the heart of all men\n\nHearken to nightmares of futility enshrined\nin sleepless terrors born of the mind\nand upon the horizon of the waking world\ntime stands still.\n\nDamnation is our destiny\nexistence is disease\nOur screams are the music of reality \n\nRelinquish all your earthly bonds\nand bow before the god of madness\nlet him untether you from pain\nstep outside the circle and be saved\n\nCrippled by the triviality, the insanity of existing\nA mockery; this master plan, crushed by the hand of fate\n\nNo solace in this hopeless cycle\nat one with fear and the darkness\nAttain mastery over shadow\npurge trepidation from your heart\n\nYour adversary is within, these mental chains are your prison\nmalignant love of your projected self; a toxic delusion\n\nChaos, decay, withering away\nthe sense of self, starting to fade"
    },
    {
      "name": "Limo Vincit Omnia",
      "duration": "7m52s",
      "lyrics": "High upon that blasted, fortified plateau\nwithin their sanctuary of salt and sorrow\n\nMorbid throngs march to the call of umbral gods\noutside comprehension    \n\nDark crusade, from deathless realm they came\nto amalgamate dimensions\n\ncerta enim gloria.\nnumquam non parata.\nDeus noster pro nobis\nLimo vincit omnia\n\nTainted youth, catechized legions of untruth\ndo they not yet comprehend?\n\nNow ensnared by the web of their deceit\nacquiescent, servile, weak\n\nThis ritual of loathsome conjuration\nakashic machinations from shadow priests who utter\nthe gathas of Mollusca\nthat poisons our existence\nbetween purity and putrescence they draw power\n\nThe bloodshed of the ancestors\nForsaken dead\nSacrificed so the worlds might mend\nall filaments have opened\nthe shadows bleed\ninfinity spewing forth from the gaping breach\n\nWe shall dredge the depths of their pestiferous swamp  \nand the last bastion of light shall fall into ruin\n\nOnce besieged, the walls shall liquify beneath\nthe force of Rhaexorog's harrowing screams\n\nTwin blasphemies; Kak and Ick shall come together\nto rouse their father from the nether"
    }
  ],
  "total_album_length": "58m39s"
}