{
  "id": "Tomb Mold - The Enduring Spirit",
  "artist_name": "Tomb Mold",
  "album_name": "The Enduring Spirit",
  "description": "After releasing three albums in three years and then spending the next four in the wilderness, Tomb Mold has been reborn on fourth album ‘The Enduring Spirit’, a thoroughly unabashed step into vast new territories. Yet for all its frenetic daring and audacious exploration, ‘The Enduring Spirit’ is never anything other than unmistakably Tomb Mold. \n\n\n\nWhile the expanding Tomb Mold architecture could be heard on last year’s self-released ‘Aperture of Body’ tape, particularly on final track ‘Prestige of Rebirth’, it comes into clear focus throughout ‘The Enduring Spirit'. Certainly Derrick Vella’s time creating within and expanding the Doom genre in Dream Unending has seeped into the flesh of Tomb Mold, not to mention Payson Power and Max Klebanoff’s explorations in their own Daydream Plus project. \n\n\n\nWith album opener ‘The Perfect Memory (Phantasm of Aura)’ the band’s angular dimension shifting riffing appears right out of the gate as the track travels through varying degrees of progressive Death Metal and some of the band’s most extreme material yet. “Will Of Whispers” enters with a jazz-like fantasy sequence before careening into a blinding white light barrage, tasteful guitar leads and back to a dreamy serpentine pattern, encompassing whole universes in its nearly 7 minute run-time. \n\n\n\nThe back half of the record continues the voyage into what’s possible with the outward expansion of Death Metal norms, reaching the zenith of 11+ minute album closer ‘The Enduring Spirit Of Calamity’, an otherworldly journey into a vortex where all things converge in space and time and generating the tree of life via luminous celestial composition. \n\n\n\nWith 4 years away, a band with boundless creative energy, as Tomb Mold are, were certain to expand the scope of their vision, and on ‘The Enduring Spirit’ they’ve shaped a record with a cinematic environment that offers unlimited avenues of exploration, both for themselves and the listener.",
  "image_url": "https://f4.bcbits.com/img/a3716311474_10.jpg",
  "bandcamp_url": "https://20buckspin.bandcamp.com/album/the-enduring-spirit",
  "tracks": [
    {
      "name": "The Perfect Memory (Phantasm of Aura)",
      "duration": "4m14s",
      "lyrics": "We are given the heat and friction of light\nTo moult in our delirious memories\nNow we dream only in familiar depths \nWhat in the bitter night speaks to us?\n\nThree sepulchral notes ring\nA phantasm of aura remains\nThe torn flesh ribbons of the absolute\nTheir presence like firelight at our backs\n\nSolo: Power\n\nAbsolution - the fateful pillar of reprieve\nThreadbare faith in the cult of seven angels \n\nLife free from illusion in the gallery for the angelic conversation\nBound to be lashed by the great white light\n\nThe stench of enlightenment degenerates my cells \n\nConstellations prostrated to me until elevation\nEver-eager and all-seeing\n\nMan may feel his breath one last time, quietly and offer no resistance\n\nSolo: Vella\n\nHow pure, the shade of this premonition \nHow hysterical our thermal maximum \nTell me, what is eternity?"
    },
    {
      "name": "Angelic Fabrications",
      "duration": "3m30s",
      "lyrics": "Dream and immaterial align \nOther lives have lived here\nWe are only tools of the spirit,\nWith no memory of life without its essentia \n\nIs my sense distorted?\nIs power for its own sake what we desire?\n\nAll that is is visible is plagued by death\nTurn your eyes away from yourself\nTo disturb the peace of even the dead \nAs if in a play of breath\n\nSpectralized androgyne\nEnthralled in the violent ether flow\nChallenge the curse of forever\n\nA single memory, grows to occupy your mind\nPlace our eternity in the hands of chance\nThe mind is incorruptible, protected by the prevailing ways \n\nI know your form, and I know your image\nBetween them, nullity\nFinality broods upon the things that pass\nWhy do we change? I wonder…"
    },
    {
      "name": "Will Of Whispers",
      "duration": "6m50s",
      "lyrics": "Every word primes the nerves\nThey dissolve our euphoric cluster \nWe are at each other’s mercy,\nBut what pushes you onward?\n\nOur roots coil and ripen, and the believing heart opens all doors \nThose fixed in their years, quietly wait for all to disappear\n\nOur tattered beauty held close to a corpse \nAll that provokes awe is sublime \n\nTime without haste\nPatience without release\nYou light your way to sorrow\n\nUnderneath the greater beauty and aura, is this where truth begins \nExperience both its calm and storm\n\nSolo: Power\n\nBehind our ache where fire forms, along the line in which spirits travel\nI want to weep there, in that place\nLead me now where you are\n\nSolo: Vella\n\nThen sleep with our sex at rest \nIt traces me to here, to where I must purge myself at last\nOur divine truth is both cruel and fatal\n\nSolo: Vella\n\nAll are allowed their secrets, all are allowed their spirits\nAll are allowed their solace, all are allowed their sorrow\nBut who will remove the blade from between my eyes?\n\nSolo: Power"
    },
    {
      "name": "Fate’s Tangled Thread",
      "duration": "6m46s",
      "lyrics": "The sickness of death is fatal, contagious\nYour body forfeited to sleep\nI do not remember the wreckage, I do not remember the waste\nThere is no place where I am not\nYour voice alive in legend\n\nWinds gnash the remaining flesh on my bones\nRotted, bristling, marked when I bled last \nEverlasting dream intravenous \nAuric bliss in referentia \n\nThey of the grand are enraptured by fate’s tangled thread,\nAnd subsist in the current of causality\n\nThe last gasp of living breath\nMy last call lost to the ether \n\nSolo: Power\n\nYour voice alive in legend, and as sharp as your ribcage \nWe each have names only we know \n\nSolo: Vella\n\nThe apocryphal dream I visit every night \nThe inalienable aura\nThey lead me to the infinite process\nThere is nothing left to hear\n\nSolo: Power\n\nGo through what has left and gone\nThere where you lay, stripped as you are\nForbidden to forget\n\nThey of the grand are enraptured by fate’s tangled thread\nThere where you lay, stripped as you are\n\nSolo: Vella\n\nThey lead me to the infinite"
    },
    {
      "name": "Flesh As Armour",
      "duration": "4m13s",
      "lyrics": "Time cuts through the narrative of flesh \nSecrets save us from dissolving\nThe wandering moon with her borrowed light\nBurdened by the unconquerable weight inherited\n\nOnce I collapsed I now see clearly \nVoices cutting across my sleep\nThey spill fourth our remaining doubts\nFragments too small to retain my Self \n\nAs I step in your shadow\nYou sing forth a chant for wings\nAnd claim the divine mastery of flesh \n\nSolo: Power\n\nWatch the mystics, regard the martyrs \nWe know the world as submissive and devouring\nThe last becomes the first once again\nI am blind to all other light\nWhat is it that keeps us from drowning?\nHow will I see my life until I have left it behind?\n\nMachines of motion are bred by bastards\nLet us be gentle when questioning ourselves \nDivide your flesh and mine\n\nSolo: Vella\n\nOur flesh as armour\nNow\nFind a way"
    },
    {
      "name": "Servants Of Possibility",
      "duration": "5m44s",
      "lyrics": "Shame is the presence pressed against me\nMy weeping with hers \nPour yourself into this miracle\nOur mania forbidding all forms of release, a tantalizing balm shared\nShame is the presence pressed against me,\nAnd pain is our most powerful magic\nIt is the fearsome initiate who tests the merit of death, then praises the mystified spiritual totality \nA single vast gold air breathed out by beings\n\nScatter misfortune\nTo be cruel, you must be illuminated\nMarch onward to the disappearance of being and destruction of form\nI embrace you above all life \n\nThe curse of forever with its beasts of possibility\nPreserved in their psycho-glory \n\nThey are seers of the cycle of reincarnate necessity \n\nWhat is left to dream? \nThat which is not, I will make myself \nWe must bleed as payment for nature and reality misled \nLife now issued by nothingness instead \n\nSolo: Power\n\nLiving while refusing life\nA rite instigated by the theatre of essence \n\nSolo: Vella\n\nAn invitation to destroy ourselves\nAll are allowed their secrets"
    },
    {
      "name": "The Enduring Spirit Of Calamity",
      "duration": "11m35s",
      "lyrics": "You will walk endlessly to find me\nBehind the karmic foil of the enslaved star\nIt is man that unveils the initiatory words\n\nThe transmutation of opposites\nThe slaying of all proponents of self \nEvery lapse forgiven\nOr at least, not felt \nBoundless latitudes revealed to each of us\n\nIs this unity mythified in our exchange of abstractions?\n\nAre we prolonging nature’s final spell?\nSecrets save us from dissolving\nYet we are still to die under the battering light\nI am replaced a thousand times over \n\nI mourn the change coming\nWhere time takes hold of us\n\nDeep in the eternal world of the demiurge \nWhere acquiescence and rebellion coalesce \nCut open by faith, left weeping within me\n\nYour whispers become a thousand spells\n\nNothing is free to those who shield their hearts\n\nSolo: Vella\n\nSolo: Power\n\nAll is free to those who bear their hearts\n\nSolo: Power\n\nSolo: Vella\n\nBut who is free from compulsion?\nSuffer this and you need suffer nothing more"
    }
  ],
  "total_album_length": "42m52s"
}